Documents/УправлениеЛьготами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеЛьготами</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеЛьготы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовУдостоверяющиеЛьготы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотребительУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговору</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоциальнаяНормаНаЛьготника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СоциальнаяНормаНаСемью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧленовСемьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УправлениеЛьготами/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуНазначенныеЛьготы(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаЛьготыНачало.ПотребительУслуг КАК ПотребительУслуг,
		|	ТаблицаЛьготыНачало.Льгота КАК Льгота,
		|	ТаблицаЛьготыНачало.ЛицевойСчет КАК ЛицевойСчет,
		|	ТаблицаЛьготыНачало.Услуга КАК Услуга,
		|	ТаблицаЛьготыНачало.КоличествоЧленовСемьи КАК КоличествоЧленовСемьи,
		|	ТаблицаЛьготыНачало.СоциальнаяНормаНаЛьготника КАК СоциальнаяНормаНаЛьготника,
		|	ТаблицаЛьготыНачало.СоциальнаяНормаНаСемью КАК СоциальнаяНормаНаСемью,
		|	НАЧАЛОПЕРИОДА(ТаблицаЛьготыНачало.ДатаНачала, ДЕНЬ) КАК Период,
		|	ИСТИНА КАК Действует
		|ИЗ
		|	ВременнаяТаблицаЛьготы КАК ТаблицаЛьготыНачало
		|ГДЕ
		|	ТаблицаЛьготыНачало.ДатаНачала <> &ПустаяДата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаЛьготыОкончание.ПотребительУслуг,
		|	ТаблицаЛьготыОкончание.Льгота,
		|	ТаблицаЛьготыОкончание.ЛицевойСчет,
		|	ТаблицаЛьготыОкончание.Услуга,
		|	ТаблицаЛьготыОкончание.КоличествоЧленовСемьи,
		|	ТаблицаЛьготыОкончание.СоциальнаяНормаНаЛьготника,
		|	ТаблицаЛьготыОкончание.СоциальнаяНормаНаСемью,
		|	КОНЕЦПЕРИОДА(ТаблицаЛьготыОкончание.ДатаОкончания, ДЕНЬ),
		|	ЛОЖЬ
		|ИЗ
		|	ВременнаяТаблицаЛьготы КАК ТаблицаЛьготыОкончание
		|ГДЕ
		|	ТаблицаЛьготыОкончание.ДатаОкончания <> &ПустаяДата";
	
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеЛьготы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицуНазначенныеЛьготы()

Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	УправлениеЛьготамиУслуги.Ссылка.Льгота,
	 |	УправлениеЛьготамиУслуги.Ссылка.ДатаНачала,
	 |	УправлениеЛьготамиУслуги.Ссылка.ДатаОкончания,
	 |	УправлениеЛьготамиУслуги.Ссылка.ПотребительУслуг,
	 |	УправлениеЛьготамиУслуги.Ссылка.ЛицевойСчет,
	 |	УправлениеЛьготамиУслуги.Услуга,
	 |	УправлениеЛьготамиУслуги.СоциальнаяНормаНаЛьготника,
	 |	УправлениеЛьготамиУслуги.СоциальнаяНормаНаСемью,
	 |	УправлениеЛьготамиУслуги.КоличествоЧленовСемьи
	 |ПОМЕСТИТЬ ВременнаяТаблицаЛьготы
	 |ИЗ
	 |	Документ.УправлениеЛьготами.Услуги КАК УправлениеЛьготамиУслуги
	 |ГДЕ
	 |	УправлениеЛьготамиУслуги.Ссылка = &Ссылка";
	 
	 
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУправлениеЛьготами);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СформироватьТаблицуНазначенныеЛьготы(ДокументСсылкаУправлениеЛьготами, СтруктураДополнительныеСвойства);

КонецПроцедуры
